# ðŸ¼ Pandas Data Management ðŸ—‚ï¸

## â¬‡ï¸ Load Data

The first step in managing data is to load it into a DataFrame.

In [3]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('csv', data_files='D:/Udemy/Luke/Data Analysis Mastering/Python for Data Analytics/DataSets/data_jobs.csv')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

# DataFrame Copy
df_original = df.copy()

### ðŸ“‹ Copy

> ðŸ§  Recall from the last lesson when we filled in missing values for median salary.

Here, let's make a new DataFrame, `df_altered` âœ¨, and only make changes to it, leaving the original DataFrame untouched. ðŸ›¡ï¸

In [4]:
# Create new dataframe
df_altered = df_original
df_altered.loc[:5 , 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

Let's fill in missing values with the median value.

In [6]:
# Calculating the median salary
median_salary = df_altered['salary_year_avg'].median()

# Filling the missing values with the median salary
df_altered['salary_year_avg'] = df_altered.loc[: , 'salary_year_avg'].fillna(median_salary)

In [7]:

df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

Now let's inspect the altered DataFrame.

In [8]:
df_altered.loc[:5,'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64


That was good...

But what about the original...

In [9]:
df_original.loc[:5,'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

Holdup!! How the heck did df_original get altered!?!

Well both the variables of df_original and df_altered are referencing the same DataFrame.

In [10]:

print('ID of df_original:               ', id(df_original))
print('ID of df_altered:                ', id(df_altered))
print('Are the two dataframes the same? ', id(df_original) == id(df_altered))

ID of df_original:                2364250289984
ID of df_altered:                 2364250289984
Are the two dataframes the same?  True


Instead we can use the .copy() method

- copy(): Copy a DataFrame.

In [11]:
df_original = df.copy()
df_altered = df_original.copy()

print('ID of df_original:               ', id(df_original))
print('ID of df_altered:                ', id(df_altered))
print('Are the two dataframes the same? ', id(df_original) == id(df_altered))

ID of df_original:                2364242158432
ID of df_altered:                 2362587768992
Are the two dataframes the same?  False

In [18]:
# Calculating the median salary
median_salary = df_altered['salary_year_avg'].median()

# Filling the missing values with the median salary
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

df_altered.loc[:5,'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [19]:
df_original.loc[:5,'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64


Now that we've created a copy of our data, we want to start our analysis. But if we have a large set of data we only want to take a subset of data to make it more manageable. We can use sample() to get a random sample of the data.

### ðŸŽ² Sample

#### ðŸ“ Notes
> `sample()`: Get a random sample of items.

#### âœ… Examples
Let's get a random sample of the data. You could get a sample with a fixed number of rows. ðŸ‘‰

In [12]:
df.sample(n=5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
444866,Data Analyst,"Data Analyst, Data Analytical Department (Ref:...",Hong Kong,via CTgoodjobs,Full-time,False,Hong Kong,2023-06-20 16:24:39,True,False,Hong Kong,None,NaN,NaN,"AEON Credit Service (Asia) Co., Ltd. (AEON ä¿¡è²¸è²¡...","['python', 'sql', 'r', 'vba', 'numpy', 'pandas...","{'analyst_tools': ['excel', 'tableau', 'dataro..."
298704,Data Engineer,Data Engineer,"Chester, UK",via WREG Jobs,Full-time,False,United Kingdom,2023-06-16 17:52:13,True,False,United Kingdom,None,NaN,NaN,Oscar Associates (UK) Limited,None,None
517465,Data Scientist,Database Engineer,"SÃ£o Paulo, State of SÃ£o Paulo, Brazil",via Empregos Trabajo.org,Full-time,False,Brazil,2023-03-22 11:34:52,False,False,Brazil,None,NaN,NaN,RecargaPay,"['no-sql', 'mongodb', 'mongodb', 'dynamodb', '...","{'cloud': ['redshift', 'aws'], 'databases': ['..."
655184,Business Analyst,Business Analyst with English and Italian,"Sofia, Bulgaria",via LinkedIn Bulgaria,Full-time,False,Bulgaria,2023-01-28 10:18:38,False,False,Bulgaria,None,NaN,NaN,DXC Technology,"['aws', 'vmware', 'excel', 'sap']","{'analyst_tools': ['excel', 'sap'], 'cloud': [..."
433765,Data Engineer,Data Engineer (m/f/d),"Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-20 16:19:01,False,False,Germany,None,NaN,NaN,LOOPING GROUP,"['python', 'sql', 'azure', 'databricks', 'reds...","{'analyst_tools': ['tableau', 'power bi', 'loo..."

Or you can randomly select a fraction of the data (e.g., 10% of the rows), with or without replacement.

In [13]:
df.sample(frac=.1 , replace=False)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
213589,Data Engineer,Big Data Engineer,"Bengaluru, Karnataka, India",via Indeed,Full-time,False,India,2023-01-17 22:13:00,False,False,India,None,NaN,NaN,Maintec,"['python', 'hadoop', 'airflow', 'kafka']","{'libraries': ['hadoop', 'airflow', 'kafka'], ..."
488141,Senior Data Analyst,Senior Data Analyst- Ecommerce,"Gurugram, Haryana, India",via Cutshort,Full-time,False,India,2023-04-13 11:17:02,True,False,India,None,NaN,NaN,Qrata,['python'],{'programming': ['python']}
232811,Senior Data Analyst,Gamma Senior Data Analyst,"BogotÃ¡, Bogota, Colombia",via BeBee,Full-time,False,Colombia,2023-08-14 07:21:10,False,False,Colombia,None,NaN,NaN,Boston Consulting Group,"['matlab', 'sas', 'sas', 'r', 'python', 'sql',...","{'analyst_tools': ['sas', 'spss', 'alteryx', '..."
618395,Data Analyst,"Data Analytics Lead, Banking","New York, NY",via Startup Jobs,Full-time,False,"New York, United States",2023-07-21 11:59:57,False,True,United States,None,NaN,NaN,Current,"['sql', 'python', 'bigquery', 'looker']","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."
47251,Data Engineer,Big Data Engineer,"Cajamarca, Peru","via Trabajo.org - Vacantes De Empleo, Trabajo",Full-time,False,Peru,2023-09-30 06:47:17,True,False,Peru,None,NaN,NaN,Emprego,"['python', 'scala', 'azure', 'databricks', 'sp...","{'cloud': ['azure', 'databricks'], 'libraries'..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
181069,Software Engineer,Software Engineer II,"Budapest, Hungary",via Trabajo.org,Full-time,False,Hungary,2023-01-16 16:11:22,False,False,Hungary,None,NaN,NaN,"Ekata, A Mastercard company","['scala', 'haskell', 'redis', 'aws', 'databric...","{'cloud': ['aws', 'databricks'], 'databases': ..."
533348,Cloud Engineer,Network Operations Engineer,"Tseung Kwan O, Hong Kong",via BeBee é¦™æ¸¯,Full-time,False,Hong Kong,2023-09-25 19:50:35,True,False,Hong Kong,None,NaN,NaN,Towngas Telecommunications Company Limited,"['html', 'css', 'sql', 'php', 'shell', 'powers...","{'os': ['linux'], 'programming': ['html', 'css..."
743296,Data Engineer,Data Engineer,"England, UK",via BeBee,Full-time,False,United Kingdom,2023-10-25 20:17:00,True,False,United Kingdom,None,NaN,NaN,Aviva plc,"['sql', 'python', 'scala', 'java', 'go', 'orac...","{'cloud': ['oracle', 'snowflake', 'aws'], 'pro..."
21509,Data Analyst,Data Analyst Co-op Spring/Summer 2023,"Seneca Falls, NY",via LinkedIn,Full-time and Internship,False,"New York, United States",2023-11-30 13:00:40,False,False,United States,None,NaN,NaN,ITT Inc.,None,None
439958,Cloud Engineer,Infrastructure Network Services Engineer II,"San Pedro Garza GarcÃ­a, Nuevo Leon, Mexico",via BeBee,Full-time,False,Mexico,2023-09-11 16:17:10,True,False,Mexico,None,NaN,NaN,Conduent,None,None

Now you can analyze these subsets of data.